emacs.d/Emacs.org
#+TITLE: @pablobfonseca's Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table of Contents
:PROPERTIES:
:TOC: :include all :ignore this
:END:
:CONTENTS:
- [[#startup-performance][Startup Performance]]
- [[#tips-for-use][Tips for Use]]
- [[#package-management][Package Management]]
  - [[#straightel][straight.el]]
  - [[#load-exec-path][Load exec-path]]
:END:

* Welcome to my Personal Emacs Config
This file generates [[file:init.el][init.el]] which can be loaded by Emacs at startup.

* Startup Performance
  Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time

  Turn on ~lexical-binding~ for the init file!
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s seconds with %d garbage collections."
                       (emacs-init-time "%.2f")
                       gcs-done)))
#+end_src

* Tips for Use
If you're looking at this file in Emacs, you can put your cursor on a link and press =C-c C-o= to open the link in your web browser.
 
* Package Management
Set up ELPA, MELPA and Org package repositories and load =use-package= to manage package configuration.
*NOTE:* Disabling tangling to test =straight.el=

#+begin_src emacs-lisp :tangle no
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("melpa-stable" . "https://stable.melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src
** straight.el
#+begin_src emacs-lisp :tangle ./early-init.el
  (setq package-enable-at-startup nil)

#+end_src

#+begin_src emacs-lisp
  ;; Bootstrap straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq straight-use-package-by-default t)

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)

  ;; Load the helper package for commands like `straight-x-clean-unused-repos'
  (require 'straight-x)
#+end_src

Sometimes it's good to clean up the unused repositories if I've removed packages from my configuration. Use ~straight-remove-unused-repos~ for this purpose.

** use-package
#+begin_src emacs-lisp
  (straight-use-package 'use-package)

  (setq use-package-always-ensure t)
#+end_src
** Load exec-path
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
  :straight t
    :init
    (setq exec-path-from-shell-check-startup-files nil)
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
    #+end_src
* Keep .emacs.d Clean
I don't want a bunch of transient files showing up as untracked in the Git repo so I move them all to another location.
#+begin_src emacs-lisp
  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering
    :straight t)

  ;; Keep customization settings in a temporary file
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)
#+end_src
** Backup files
#+begin_src emacs-lisp
  ;; store all backup and autosave files in the tmp dir
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))
#+end_src
* Default Coding System
Avoid constant errors about the encoding system by setting the default to UTF-8
#+begin_src emacs-lisp
(set-default-coding-systems 'utf-8)
#+end_src
* Server mode
  Start the Emacs server from this instance so that all ~emacsclient~ calls are routed here.
#+begin_src emacs-lisp
  (server-start)
#+end_src

* Keybindings Configuration
** Global keybindings
#+begin_src emacs-lisp
  ;; Align your code in a pretty way
  (global-set-key (kbd "C-x \\") 'align-regexp)

  ;; Font size
  (global-set-key (kbd "C-+") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)

  ;; Window switching. (C-x o goes to the next window)
  (global-set-key (kbd "C-x O") (lambda ()
                                  (interactive)
                                  (other-window -1))) ;; back one

  ;; Start vterm or switch to it if it's active
  (global-set-key (kbd "C-x m") 'vterm)

  ;; replace buffer-menu with ibuffer
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src
** EscCancels All
#+begin_src emacs-lisp

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src
** Rebing C-u
Re-bind =C-M-u= for =universal-argument= since =evil-mode= takes over =C-u= for buffer scrolling.
#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src

** Let's Be Evil

Some tips can be found here:
[[https://github.com/noctuid/evil-guide][https://github.com/noctuid/evil-guide]]
[[https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html][https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html]]

  This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.  [[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

#+begin_src emacs-lisp
  (defun personal/evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

  (defun personal/dont-arrow-me-bro ()
    (interactive)
    (message "Arrow keys are bad, you know?"))

  (use-package undo-tree
    :straight t
    :init
    (global-undo-tree-mode 1)
    :config
    (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))

  (use-package evil
    :straight t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-respect-visual-line-mode t)
    (setq evil-undo-system 'undo-tree)
    :hook (evil-mode . personal/evil-hook)
    :config
    (add-hook 'evil-mode-hook 'personal/evil-hook)
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode-buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)

    ;; Define new key bindings for projectile
    (define-key evil-normal-state-map (kbd "M-p") 'projectile-switch-project)
    (define-key evil-normal-state-map (kbd "C-p") 'projectile-find-file)

    ;; Disable arrow keys in normal and visual modes
    (define-key evil-normal-state-map (kbd "<left>") 'personal/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<right>") 'personal/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<down>") 'personal/dont-arrow-me-bro)
    (define-key evil-normal-state-map (kbd "<up>") 'personal/dont-arrow-me-bro)

    (evil-global-set-key 'motion (kbd "<left>") 'personal/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<right>") 'personal/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<down>") 'personal/dont-arrow-me-bro)
    (evil-global-set-key 'motion (kbd "<up>") 'personal/dont-arrow-me-bro)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-matchit
    :straight t
    :config
    (global-evil-matchit-mode 1))

  (use-package evil-collection
    :straight t
    :after evil
    :config
    (evil-collection-init)
    :custom
    (evil-collection-outline-bind-tab-p nil)
    :config
    (evil-collection-init))
#+end_src

*** evil-multiedit
#+begin_src emacs-lisp
  ;; (use-package evil-multiedit
  ;;   :straight t
  ;;   :config
  ;;   (define-key evil-normal-state-map (kbd "C-n") 'evil-multiedit-match-and-next)
  ;;   (define-key evil-visual-state-map (kbd "C-n") 'evil-multiedit-match-and-next))

  (use-package multiple-cursors
    :straight t
    :config
    (define-key evil-normal-state-map (kbd "C-n") 'mc/mark-next-like-this)
    (define-key evil-visual-state-map (kbd "C-n") 'mc/mark-next-like-this))

#+end_src

*** evil-surround
#+begin_src emacs-lisp
  (use-package evil-surround
    :straight t
    :config
    (global-evil-surround-mode 1))
#+end_src

