emacs.d/init.el
;; -*- lexical-binding: t; -*-

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s seconds with %d garbage collections."
                     (emacs-init-time "%.2f")
                     gcs-done)))

;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq straight-use-package-by-default t)

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)

(straight-use-package 'use-package)

(setq use-package-always-ensure t)

(use-package exec-path-from-shell
:straight t
  :init
  (setq exec-path-from-shell-check-startup-files nil)
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

;; Use no-littering to automatically set common paths to the new user-emacs-directory
(use-package no-littering
  :straight t)

;; Keep customization settings in a temporary file
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)

;; store all backup and autosave files in the tmp dir
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(set-default-coding-systems 'utf-8)

(server-start)

;; Align your code in a pretty way
(global-set-key (kbd "C-x \\") 'align-regexp)

;; Font size
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

;; Window switching. (C-x o goes to the next window)
(global-set-key (kbd "C-x O") (lambda ()
                                (interactive)
                                (other-window -1))) ;; back one

;; Start vterm or switch to it if it's active
(global-set-key (kbd "C-x m") 'vterm)

;; replace buffer-menu with ibuffer
(global-set-key (kbd "C-x C-b") 'ibuffer)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-set-key (kbd "C-M-u") 'universal-argument)

(defun personal/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))

(defun personal/dont-arrow-me-bro ()
  (interactive)
  (message "Arrow keys are bad, you know?"))

(use-package undo-tree
  :straight t
  :init
  (global-undo-tree-mode 1)
  :config
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))

(use-package evil
  :straight t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-respect-visual-line-mode t)
  (setq evil-undo-system 'undo-tree)
  :hook (evil-mode . personal/evil-hook)
  :config
  (add-hook 'evil-mode-hook 'personal/evil-hook)
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode-buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)

  ;; Define new key bindings for projectile
  (define-key evil-normal-state-map (kbd "M-p") 'projectile-switch-project)
  (define-key evil-normal-state-map (kbd "C-p") 'projectile-find-file)

  ;; Disable arrow keys in normal and visual modes
  (define-key evil-normal-state-map (kbd "<left>") 'personal/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<right>") 'personal/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<down>") 'personal/dont-arrow-me-bro)
  (define-key evil-normal-state-map (kbd "<up>") 'personal/dont-arrow-me-bro)

  (evil-global-set-key 'motion (kbd "<left>") 'personal/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<right>") 'personal/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<down>") 'personal/dont-arrow-me-bro)
  (evil-global-set-key 'motion (kbd "<up>") 'personal/dont-arrow-me-bro)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-matchit
  :straight t
  :config
  (global-evil-matchit-mode 1))

(use-package evil-collection
  :straight t
  :after evil
  :config
  (evil-collection-init)
  :custom
  (evil-collection-outline-bind-tab-p nil)
  :config
  (evil-collection-init))

;; (use-package evil-multiedit
;;   :straight t
;;   :config
;;   (define-key evil-normal-state-map (kbd "C-n") 'evil-multiedit-match-and-next)
;;   (define-key evil-visual-state-map (kbd "C-n") 'evil-multiedit-match-and-next))

(use-package multiple-cursors
  :straight t
  :config
  (define-key evil-normal-state-map (kbd "C-n") 'mc/mark-next-like-this)
  (define-key evil-visual-state-map (kbd "C-n") 'mc/mark-next-like-this))

(use-package evil-surround
  :straight t
  :config
  (global-evil-surround-mode 1))
