emacs.d/Emacs.org
** Keybinding Panel (which-key)

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp
  (use-package which-key
    :straight t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

** Simplify Leader Bindings (general.el)

#+begin_src emacs-lisp

  (use-package general
    :straight t
    :config
    (general-create-definer personal/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (personal/leader-keys
      "t" '(:ignore t :which-key "toggles")
      "tw" 'whitespace-mode
      "tt" '(counsel-load-theme :which-key "choose theme")))

#+end_src

* General Configuration
** User Interface
Make Emacs more minimal
#+begin_src emacs-lisp
  ;; Open emacs maximized
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)              ; Disable visible scrollbar
  (tool-bar-mode -1)                ; Disable the toolbar
  (tooltip-mode -1)                 ; Disable the tooltips
  (set-fringe-mode 10)              ; Give some breathing room
  (menu-bar-mode -1)                ; Disable the menu bar
  (setq ring-bell-function 'ignore) ; Ignore bell
  (setq display-line-numbers-type 'relative) ; Relative line numbers

  ;; nice scrolling
  (setq scroll-margin 0
        scroll-conservatively 100000
        scroll-preserve-screen-position 1)

  ;; remap scroll-other-window
  (global-set-key (kbd "C-M-e") 'scroll-other-window)
  (global-set-key (kbd "C-M-y") 'scroll-other-window-down)

  ;; enable y/n answers
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; Highlight current line
  (global-hl-line-mode 1)
#+end_src

Enable line numbers and customize their format.

#+begin_src emacs-lisp
(column-number-mode)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

;; Override some modes which derive from the above
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

Don't warn for large files
#+begin_src emacs-lisp
(setq large-file-warning-threshold nil)
#+end_src

Don't warn for following symlinked files
#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src
** Theme

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp

  (use-package doom-themes
    :straight t
    :defer t
    :init (load-theme 'doom-dracula t))

#+end_src

** Font
*** Set the font

I am using the [[https://www.programmingfonts.org/#jetbrainsmono][JetBrainsMono]] and [[https://fonts.google.com/specimen/Cantarell][Cantarell]] fonts for this configuration which will more than likely need to be installed on your machine.  Both can usually be found in the various Linux distro package managers or downloaded from the links above.

#+begin_src emacs-lisp
(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :family "Regular" :height 190)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :family "Regular" :height 190)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 190 :weight 'normal)
#+end_src

*** Enable proper Unicode glyph support
#+begin_src emacs-lisp
(defun personal/replace-unicode-font-mapping (block-name old-font new-font)
  (let* ((block-idx (cl-position-if
                         (lambda (i) (string-equal (car i) block-name))
                         unicode-fonts-block-font-mapping))
         (block-fonts (cadr (nth block-idx unicode-fonts-block-font-mapping)))
         (updated-block (cl-substitute new-font old-font block-fonts :test 'string-equal)))
    (setf (cdr (nth block-idx unicode-fonts-block-font-mapping))
          `(,updated-block))))

(use-package unicode-fonts
  :straight t
  :custom
  (unicode-fonts-skip-font-groups '(low-quality-glyphs))
  :config
  ;; Fix the font mappings to use the right emoji font
  (mapcar
    (lambda (block-name)
      (personal/replace-unicode-font-mapping block-name "Apple Color Emoji" "Noto Color Emoji"))
    '("Dingbats"
      "Emoticons"
      "Miscellaneous Symbols and Pictographs"
      "Transport and Map Symbols"))
  (unicode-fonts-setup))
 #+end_src
 
*** Emojis in buffers
#+begin_src emacs-lisp
  ;; Enable emoji, and stop the UI from freezing when trying to display them
  (when (fboundp 'set-fontset-font)
    (set-fontset-font t 'unicode "Apple Color Emoji" nil 'prepend))

  (use-package emojify
    :straight t
    :hook (erc-mode . emojify-mode)
    :commands emojify-mode)
#+end_src

** Mode Line
*** Basic Customization
#+begin_src emacs-lisp
(setq display-time-format "%l:%M %p %b %y"
      display-time-default-load-average nil)
#+end_src
*** Enable Mode Diminishing

The [[https://github.com/myrjola/diminish.el][diminish]] package hides pesky minor modes from the modelines.
#+begin_src emacs-lisp
  (use-package diminish
    :straight t)
#+end_src

*** Smart Mode Line
Prettify the modeline with [[https://github.com/Malabarba/smart-mode-line/][smart-mode-line]]. Really need to re-evaluate the ordering of =mode-line-format=. Also not sure if =rm-excluded-modes= is needed anymore if I set up =diminish= correctly.

#+begin_src emacs-lisp
  (use-package smart-mode-line
    :straight t
    :disabled
    :config
    (setq sml/no-confirm-load-theme t)
    (sml/setup)
    (sml/apply-theme 'respectful)  ; Respect the theme colors
    (setq sml/mode-width 'right
          sml/name-width 60)

    (setq-default mode-line-format
                  `("%e"
                    ,(when personal/exwm-enabled
                       '(:eval (format "[%d] " exwm-workspace-current-index)))
                    mode-line-front-space
                    evil-mode-line-tag
                    mode-line-mule-info
                    mode-line-client
                    mode-line-modified
                    mode-line-remote
                    mode-line-frame-identification
                    mode-line-buffer-identification
                    sml/pos-id-separator
                    (vc-mode vc-mode)
                    " "
                                          ;mode-line-position
                    sml/pre-modes-separator
                    mode-line-modes
                    " "
                    mode-line-misc-info))

    (setq rm-excluded-modes
          (mapconcat
           'identity
                                          ; These names must start with a space!
           '(" GitGutter" " MRev" " company"
             " Helm" " Undo-Tree" " Projectile.*" " Z" " Ind"
             " Org-Agenda.*" " ElDoc" " SP/s" " cider.*")
           "\\|")))
#+end_src

*** Doom Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run =M-x all-the-icons-install-fonts= so that mode line icons display correctly.

#+begin_src emacs-lisp
  ;; You must run (all-the-icons-install-fonts) one time after
  ;; installing the package!

  (use-package all-the-icons
    :straight t)

  (use-package doom-modeline
    :straight t
    :init (doom-modeline-mode 1)
    :custom (doom-modeline-height 14))
#+end_src

** Auto-Reverting Changed Files
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src
** Highlight Matching Braces
#+begin_src emacs-lisp
  (use-package paren
    :straight t
    :config
    (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
    (show-paren-mode 1))
#+end_src
* Editing Configuration
** Tab Widths
Default to an indentation size of 2 spaces since it's the norm for pretty much every language I use
#+begin_src emacs-lisp
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)
#+end_src

** Hippie Expand
#+begin_src emacs-lisp
  ;; hippie expand is dabbrev expand on steroids
  (setq hippie-expand-try-functions-list '(try-expand-dabbrev
                                           try-expand-dabbrev-all-buffers
                                           try-expand-dabbrev-from-kill
                                           try-complete-file-name-partially
                                           try-complete-file-name
                                           try-expand-all-abbrevs
                                           try-expand-list
                                           try-expand-line
                                           try-complete-listp-symbol-partially
                                           try-complete-listp-symbol))

#+end_src

