emacs.d/Emacs.org
** Use spaces instead of tabs for indentation
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src
** Commenting
Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :straight t
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src
** Automatically clean whitespace
#+begin_src emacs-lisp
  (use-package ws-butler
    :straight t
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode)))
#+end_src

** Editor Config
#+begin_src emacs-lisp
  (use-package editorconfig
    :straight t
    :ensure t
    :config
    (editorconfig-mode 1))
#+end_src

** Origami.el for Folding
#+begin_src emacs-lisp
  (use-package origami
    :straight t)
#+end_src

** expand region
#+begin_src emacs-lisp
  (use-package expand-region
    :straight t
    :bind ("C-=" . er/expand-region))
#+end_src

* Configuration Files
** Configuration file management with dotcrafter.el
#+begin_src emacs-lisp
  (use-package dotcrafter
    :straight '(dotcrafter :host github
                           :repo "daviwil/dotcrafter.el"
                           :branch "main")
    :custom
    (dotcrafter-dotfiles-folder "~/.emacs.d")
    (dotcrafter-org-files '("Emacs.org")))
#+end_src
** Helpers
#+begin_src emacs-lisp
  (defun personal/org-file-jump-to-heading (org-file heading-title)
    (interactive)
    (find-file (expand-file-name org-file))
    (goto-char (point-min))
    (search-forward (concat "* " heading-title))
    (org-overview)
    (org-reveal)
    (org-show-subtree)
    (forward-line))

  (defun personal/org-file-show-headings (org-file)
    (interactive)
    (find-file (expand-file-name org-file))
    (counsel-org-goto)
    (org-overview)
    (org-reveal)
    (org-show-subtree)
    (forward-line))
#+end_src
** Bindings
#+begin_src emacs-lisp
  (personal/leader-keys
    "f"  '(:ignore t :which-key "dotfiles")
    "fe" '((lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")) :which-key "edit config")
    "fz" '((lambda () (interactive) (find-file "~/.dotfiles/Zsh.org")) :which-key "edit zsh config")
    "fv" '((lambda () (interactive) (find-file "~/.dotfiles/Vim.org")) :which-key "edit vim config"))
#+end_src
* UI Configuration
** Command Log Mode
[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp
  (use-package command-log-mode
    :straight t)
#+end_src
** Helpful Help Command

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp
  (use-package helpful
    :straight t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
** Text Scaling


This is an example of using [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp
  (use-package hydra
    :straight t
    :defer 1)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (personal/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src
* Ivy and Counsel

-  While in an Ivy minibuffer, you can search within the current results by using =S-Space=
-  To quickly jump to an item in the minibuffer, use =C-'= to get Ivy line jump keys.
-  To see actions for the selected minibuffer item, use =M-o= and then press the action's key
-  *Super useful*: Use =C-c C-o= to open =ivy-occur= to open the search results in a separated buffer. From there you can click any item to perform the ivy action.

#+begin_src emacs-lisp
  (use-package ivy
    :straight t
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :init
    (ivy-mode 1)
    :config
    (setq ivy-use-virtual-buffers t)
    (setq ivy-wrap t)
    (setq ivy-count-format "(%d/%d) ")
    (setq enable-recursive-minibuffers t)

    ;; Use different regex strategies per completion command
    (push '(completion-at-point . ivy--regex-fuzzy) ivy-re-builders-alist)
    (push '(swiper . ivy--regex-ignore-order) ivy-re-builders-alist)
    (push '(counsel-M-x . ivy--regex-ignore-order) ivy-re-builders-alist)


    ;; Set minibuffer heght for different commands
    (setf (alist-get 'swiper ivy-height-alist) 15)
    (setf (alist-get 'counsel-switch-buffer ivy-height-alist) 7))

  (use-package ivy-rich
    :straight t
    :init
    (ivy-rich-mode 1)
    :after counsel
    :config
    (setq ivy-format-function #'ivy-format-function-line)
    (setq ivy-rich-display-transformers-list
          (plist-put ivy-rich-display-transformers-list
                     'ivy-switch-buffer
                     '(:columns
                       ((ivy-rich-candidate (:width 40))
                        (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right)); return the buffer indicators
                        (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))          ; return the major mode info
                        (ivy-rich-switch-buffer-project (:width 15 :face success))             ; return project name using `projectile'
                        (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))))))  ; return file path relative to project root or `default-directory' if project is nil

  (use-package counsel
    :straight t
    :bind (("M-x" . counsel-M-x)
           ("C-M-j" . counsel-switch-buffer)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           ("C-M-l" . counsel-imenu)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1)
    (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^

  ;; Improves sorting for fuzzy-matched results
  (use-package flx
    :straight t
    :after ivy
    :defer t
    :init
    (setq ivy-flx-limit 10000))

  (use-package wgrep
    :straight t)

  (use-package ivy-posframe
    :straight t
    :disabled
    :custom
    (ivy-posframe-width 115)
    (ivy-posframe-min-width 115)
    (ivy-posframe-height 10)
    :config
    (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
    (setq ivy-posframe-parameters '((parent-frame . nil)
                                    (left-fringe . 8)
                                    (right-fringe . 8)))
    (ivy-posframe-mode 1))

  (personal/leader-keys
    "r" '(ivy-resume :which-key "ivy resume")
    "f" '(:ignore t :which-key "files")
    "ff" '(counsel-find-file :which-key "open file")
    "C-f" 'counsel-find-file
    "fr" '(counsel-recentf :which-key "recent files")
    "fR" '(revert-buffer :which-key "revert file")
    "fj" '(counsel-file-jump :which-key "jump to file"))

  (use-package swiper
    :straight t
    :after ivy
    :bind (("C-s" . swiper)
           ("C-r" . swiper)))
#+end_src
* Jumping with Avy
#+begin_src emacs-lisp
  (use-package avy
    :straight t
    :commands (avy-goto-char avy-goto-word-0 avy-goto-line))

  (personal/leader-keys
    "j" '(:ignore t :which-key "jump")
    "jj" '(avy-goto-char :which-key "jump to char")
    "jw" '(avy-goto-word-0 :which-key "jump to word")
    "jl" '(avy-goto-line :which-key "jump to line"))
#+end_src
* Window Management
** Frame Scaling / Zooming
The keybindings for this are =C+M+-= and =C+M+==
#+begin_src emacs-lisp
  (use-package default-text-scale
    :straight t
    :defer 1
    :config
    (default-text-scale-mode))
#+end_src
