emacs.d/Emacs.org
** Bindings
#+begin_src emacs-lisp
  (fset 'evil-redirect-digit-argument 'ignore) ;; before evil-org loaded

  (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
  (evil-define-key 'motion 'evil-org-mode
    (kbd "0") 'evil-org-beginning-of-line)

  (use-package evil-org
    :straight t
    :after org
    :hook ((org-mode . evil-org-mode)
           (org-agenda-mode . evil-org-mode)
           (evil-org-mode . (lambda () (evil-org-set-key-theme '(navigation todo insert textobjects additional)))))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  (personal/leader-keys
    "o" '(:ignore t :which-key "org mode")
    "oi" '(:ignore t :which-key "insert")
    "oil" '(org-insert-link :which-key "insert link")
    "on" '(org-toggle-narrow-to-subtree :which-key "toggle narrow")
    "oa" '(org-agenda :which-key "status")
    "ot" '(org-todo-list :which-key "todos")
    "oc" '(org-capture t :which-key "capture")
    "ox" '(org-export-dispatch t :which-key "export")))

#+end_src
* Development
** tree-sitter
#+begin_src emacs-lisp
(use-package tree-sitter
  :straight t
  :config
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :straight t
  :after tree-sitter)
#+end_src
** auto-format
#+begin_src emacs-lisp
  (use-package apheleia
    :straight t
    :config
    (apheleia-global-mode +1))
#+end_src
** Compile mode
#+begin_src emacs-lisp
  (defvar *compile-command-map* '(("py" . "python")
                                  ("go" . "go run")
                                  ("rb" . "ruby")
                                  ("js" . "node")))

  (defun ~run-current-file (f command-map)
    "Run command map with function f
    f can be: compile, ~acme$, ~acme&, ~acme!"
    (interactive)
    (save-buffer)

    (let* ((fname (s-chop-suffix (car (s-match "<.*>" (buffer-name))) (buffer-name)))
           (suffix (file-name-extension fname))
           (prog (cdr (assoc suffix command-map))))
      (if (null prog)
          (error "Extension is not yet registered")
        (funcall f (format "%s %s" prog (shell-quote-argument fname))))))

  (defun ~compile-current-file ()
    "(re)compile the current file. A replacement for compile with automatic filetype recognition.
                                e.g. If the current buffer is hello.py, then it'll call python hello.py"
    (interactive)
    (save-buffer)
    (~run-current-file 'compile *compile-command-map*))

  ;; default compile command to empty string
  (setq compile-command "")

  (defun ~recompile ()
    "custom recompile "
    (interactive)
    (save-buffer)
    (recompile))

  (defvar *test-command-map* '(("py" . "pytest -s -v")
                               ("go" . "go test")))

  (defun ~test-current-file ()
    "Test current file using 'compile'. Automatic filetype recogntion.
      e.g. If the current buffer is hello.py, then it'll call pytest hello.py
      "
    (interactive)
    (~run-current-file 'compile *test-command-map*))

  (personal/leader-keys
    "c" '(:ignore t :which-key "compile")
    "cc" '(~compile-current-file :which-key "compile current file")
    "ct" '(~test-current-file :which-key "test current file"))
#+end_src
** Git
*** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :bind ("C-M-;" . magit-status)
    :commands (magit-status)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (personal/leader-keys
    "g" '(:ignore t :which-key "git")
    "gs" 'magit-status
    "gd" 'magit-diff-unstaged
    "gc" 'magit-branch-or-checkout
    "gl" '(:ignore t :which-key "log")
    "glc" 'magit-log-current
    "glf" 'magit-log-buffer-file
    "gb" 'magit-branch
    "gP" 'magit-push-current
    "gp" 'magit-pull-branch
    "gf" 'magit-fetch
    "gF" 'magit-fetch-all
    "gr" 'magit-rebase)

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
#+end_src

*** Forge
#+begin_src emacs-lisp
  (use-package forge
    :straight t)
#+end_src

*** magit-todos
This is an interesting extension to Magit that shows a TODOs section in your git status buffer containing all lines with TODO (or other similar words) in files contained within the repo. More information at the [[https://github.com/alphapapa/magit-todos][GitHub repo]].
#+begin_src emacs-lisp
  (use-package magit-todos
    :straight t
    :defer t)
#+end_src
*** git-link
#+begin_src emacs-lisp
  (use-package git-link
    :straight t
    :commands git-link
    :config
    (setq git-link-open-in-browser t)
    (personal/leader-keys
      "gL" 'git-link))
#+end_src
*** Git Gutter
#+begin_src emacs-lisp
  (use-package git-gutter
    :straight git-gutter-fringe
    :diminish
    :hook ((text-mode . git-gutter-mode)
           (prog-mode . git-gutter-mode))
    :config
    (setq git-gutter:update-interval 2)
    (require 'git-gutter-fringe)
    (set-face-foreground 'git-gutter-fr:added "LightGreen")
    (fringe-helper-define 'git-gutter-fr:added nil
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX")

    (set-face-foreground 'git-gutter-fr:modified "LightGoldenrod")
    (fringe-helper-define 'git-gutter-fr:modified nil
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX")

    (set-face-foreground 'git-gutter-fr:deleted "LightCoral")
    (fringe-helper-define 'git-gutter-fr:deleted nil
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      ".........."
      ".........."
      "XXXXXXXXXX"
      "XXXXXXXXXX"
      "XXXXXXXXXX")

    ;; These characters are used in terminal mode
    (setq git-gutter:modified-sign "≡")
    (setq git-gutter:added-sign "≡")
    (setq git-gutter:deleted-sign "≡")
    (set-face-foreground 'git-gutter:added "LightGreen")
    (set-face-foreground 'git-gutter:modified "LightGoldenrod")
    (set-face-foreground 'git-gutter:deleted "LightCoral"))
#+end_src
** Languages

*** Language Server Support
**** lsp-mode
#+begin_src emacs-lisp

  (defun personal/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :straight t
    :commands lsp
    :hook (lsp-mode . personal/lsp-mode-setup)
    :config
    (define-key evil-normal-state-map (kbd ",ra") 'lsp-rename)

    (lsp-enable-which-key-integration t)
    :bind (:map lsp-mode-map
                ("TAB" . completion-at-point))
    :custom (lsp-headerline-breadcrumb-enable nil))

  (personal/leader-keys
    "l" '(:ignore t :which-key "lsp")
    "ld" 'lsp-find-definition
    "lr" 'lsp-find-references
    "ln" 'lsp-ui-find-next-reference
    "lp" 'lsp-ui-find-prev-reference
    "ls" 'counsel-imenu
    "le" 'lsp-ui-flycheck-list
    "lS" 'lsp-ui-sideline-mode
    "lx" 'lsp-execute-code-action)

#+end_src
**** lsp-ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (define-key evil-normal-state-map (kbd "H") 'lsp-ui-doc-glance)
    (setq lsp-ui-doc-position 'at-point))
#+end_src
**** eglot
#+begin_src emacs-lisp
  (use-package eglot
    :straight t)
#+end_src
****
*** Ruby
#+begin_src emacs-lisp
  (use-package ruby-mode
    :mode ("\\.rb\\'" "Rakefile\\'" "Gemfile\\'")
    :hook (ruby-mode . lsp)
    :interpreter "ruby"
    :config
    (setq ruby-insert-encoding-magic-comment nil)
    (add-hook 'ruby-mode-hook (lambda () (rvm-activate-corresponding-ruby)))
    :bind (:map ruby-mode-map
                ("\C-c r r" . inf-ruby)))

  (use-package bundler
    :straight t)
  (use-package rvm
    :straight t)

  (use-package inf-ruby
    :straight t
    :hook (ruby-mode . inf-ruby-minor-mode))

  (use-package rbs-mode
    :straight t)
#+end_src
