emacs.d/Emacs.org
**** Robe
#+begin_src emacs-lisp
  (use-package robe
    :straight t
    :hook (ruby-mode . robe-mode)
    :bind ("C-M-." . robe-jump)
    :config
    (defadvice inf-ruby-console-auto (before activate-rvm-for-robe activate)
      (rvm-activate-corresponding-ruby)))
#+end_src
**** Rubocop
#+begin_src emacs-lisp
  (use-package rubocop
    :straight t)
#+end_src
**** rspec-mode
#+begin_src emacs-lisp
  (use-package rspec-mode
    :straight t
    :after ruby-mode
    :init
    (progn
      (setq rspec-use-spring-when-possible nil)
      (setq rspec-use-rake-flag nil))
    :config
    (setq rspec-use-rvm t)
    (add-hook 'after-init-hook 'inf-ruby-switch-setup))
#+end_src

*** Python

#+begin_src emacs-lisp
  (use-package python-mode
    :straight t
    :hook (python-mode . lsp))

  (use-package lsp-pyright
    :ensure t
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp))))  ; or lsp-deferred
                          #+end_src
**** pyvenv
#+begin_src emacs-lisp
  (use-package pyvenv
    :straight t
    :hook (python-mode . pyvenv-mode))
#+end_src
*** Typescript and JavaScript
Set up nvm so that we can manage Node versions
#+begin_src emacs-lisp
  (use-package nvm
    :straight t)
#+end_src

  This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.


#+begin_src emacs-lisp
  (use-package typescript-mode
    :after tree-sitter
    :mode (("\\.tsx?\\'" . typescript-mode)
           ("\\.tsx\\'" . rjsx-mode))
    :hook (typescript-mode . lsp)
    :config
    (define-derived-mode typescriptreact-mode typescript-mode
      "TypeScript TSX")

    ;; use our derived mode for tsx files
    (add-to-list 'auto-mode-alist '("\\.tsx?\\'" . typescriptreact-mode))
    ;; by default, typescript-mode is mapped to the treesitter typescript parser
    ;; use our derived mode to map both .tsx AND .ts -> typescriptreact-mode -> treesitter tsx
    (add-to-list 'tree-sitter-major-mode-language-alist '(typescriptreact-mode . tsx))
    (setq typescript-indent-level 2))

  (defun personal/set-js-indentation ()
    ;; electric-layout-mode doesn't play nice with smartparens
    (setq-local electrict-layout-rules '((?\{ . around) (?\} . around)))
    (setq js-indent-level 2)
    (setq evil-shift-width js-indent-level)
    (setq-default tab-width 2))

  (use-package js2-mode
    :straight t
    :hook (js2-mode . lsp)
    :mode "\\.jsx?\\'"
    :config
    ;; Use js2-mode for Node scripts
    (add-to-list 'magic-mode-alist '("#!/usr/bin/env node" . js2-mode))

    ;; Don't use built-in syntax checking
    (setq js2-mode-show-strict-warnings nil)

    ;; Set up proper indentation in JavascScript and JSON files
    (add-hook 'js2-mode-hook #'personal/set-js-indentation))

  (use-package json-mode
    :straight t
    :config
    (add-hook 'json-mode-hook #'personal/set-js-indentation))
#+end_src

**** Indium
#+begin_src emacs-lisp
  (use-package indium
    :straight t)
#+end_src
*** Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :straight t
    :mode "\\.md\\'"
    :config
    (setq markdown-command "marked")
    (defun personal/set-markdown-header-font-sizes ()
      (dolist (face '((markdown-header-face-1 . 1.2)
                      (markdown-header-face-2 . 1.1)
                      (markdown-header-face-3 . 1.0)
                      (markdown-header-face-4 . 1.0)
                      (markdown-header-face-5 . 1.0)))
        (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))
        (defun personal/markdown-mode-hook ()
          (personal/set-markdown-header-font-sizes))
    (add-hook 'markdown-mode-hook 'personal/markdown-mode-hook))
#+end_src
*** HTML (web mode)
#+begin_src emacs-lisp
  (use-package web-mode
    :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
    :config
    (setq web-mode-enable-auto-pairing nil)
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-css-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))
    (setq-default web-mode-attr-indent-offset 2))
#+end_src
**** Impatient mode
#+begin_src emacs-lisp
  ;; 1. Start the server with `httpd-start`
  ;; 2. Use `impatient-mode` on any buffer
  (use-package impatient-mode
    :straight t)
#+end_src
**** CSS
#+begin_src emacs-lisp
(use-package css-mode
  :hook (css-mode . lsp)
  :config
  (setq-default css-indent-offset 2))
#+end_src
**** HAML
#+begin_src emacs-lisp
  (use-package haml-mode
    :straight t)
#+end_src
**** Emmet mode
#+begin_src emacs-lisp
  (use-package emmet-mode
    :straight t
    :diminish (emmet-mode . "ε")
    :bind* (("C-)" . emmet-next-edit-point)
            ("C-(" . emmet-prev-edit-point))
    :commands (emmet-mode
               emmet-next-edit-point
               emmet-prev-edit-point)
    :custom
    (emmet-indentation 2)
    (emmet-move-cursor-between-quotes t)
    :mode
    (("\\.html$\\'" . emmet-mode)
     ("\\.xml\\'" . emmet-mode)
     ("\\.erb\\'" . emmet-mode))
    :init
    ;; Auto-start on any markup modes
    (add-hook 'sgml-mode-hook 'emmet-mode)
    (add-hook 'web-mode-hook 'emmet-mode))
#+end_src

*** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.ya?ml\\'")
#+end_src
*** Go
#+begin_src emacs-lisp
  (defun personal/go-mode-defaults ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t)
    (add-hook 'go-mode-hook #'lsp-deferred)
    (define-key 'help-command (kbd "G") 'godoc)

    (setq tab-width 4)
    (setq evil-shift-width tab-width)

    ;; Prefer goimports to gofmt if installed
    (let ((goimports (executable-find "goimports")))
      (when goimports
        (setq gofmt-command goimports)))

    ;; gofmt on save
    (add-hook 'before-save-hook 'gofmt-before-save nil t))

  (use-package go-mode
    :straight t
    :defer t
    :hook (go-mode . lsp)
    :config
    (add-hook 'go-mode-hook #'personal/go-mode-defaults))
#+end_src
*** Rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :straight t
    :hook (rust-mode . lsp)
    :mode "\\.rs\\'"
    :init (setq rust-format-on-save t))

  (use-package cargo
    :straight t
    :defer t)
#+end_src
*** Haskell
#+begin_src emacs-lisp
  (use-package lsp-haskell
    :straight t
    :defer t)

  (use-package haskell-mode
    :straight t
    :config
    (add-hook 'haskell-mode-hook #'lsp)
    (add-hook 'haskell-literate-mode-hook #'lsp))
#+end_src
*** Elm
#+begin_src emacs-lisp
  (use-package elm-mode
    :straight t
    :config
    (setq elm-format-on-save t))
#+end_src
