emacs.d/init.el

(use-package caml
  :straight t)

(use-package tuareg
  :hook (tuareg-mode . lsp)
  :mode ("\\.ml[ily]?$" . tuareg-mode)
  :straight t)

;; (use-package merlin
;;   :straight t
;;   :custom
;;   (merlin-completion-with-doc t)
;;   :bind (:map merlin-mode-map
;;               ("M-." . merlin-locate)
;;               ("M-," . merlin-pop-stack)
;;               ("M-?" . merlin-occurrences)
;;               ("C-c C-j" . merlin-jump)
;;               ("C-c i" . merlin-locate-ident)
;;               ("C-c C-e" . merlin-iedit-occurrences))
;;   :hook
;;   ;; Start merlin on ml files
;;   ((reason-mode tuareg-mode caml-mode) . merlin-mode))

(use-package utop
  :custom
  (utop-edit-command nil)
  :hook
  (tuareg-mode . (lambda ()
                   (setq utop-command "utop -emacs")
                   (utop-minor-mode)))
  (reason-mode . (lambda ()
                   (setq utop-command "rtop -emacs")
                   (setq utop-prompt
                         (lambda ()
                           (let ((prompt (format "rtop[%d]> " utop-command-number)))
                             (add-text-properties 0 (lenght prompt) '(face utop-prompt) prompt)
                             prompt)))
                   (utop-minor-mode)))
  :straight t)

(defun shell-cmd (cmd)
  "Returns the stdout output of a shell command or nil if the command returned an error"
  (car (ignore-errors (apply 'process-lines (split-string cmd)))))

(setq opam-p (shell-cmd "which opam"))
(setq reason-p (shell-cmd "which refmt"))

(use-package reason-mode
  :straight t
  :if reason-p
  :config
  (add-hook 'reason-mode-hook (lambda ()
                                (add-hook 'before-save-hook #'refmt-before-save)))
  (let* ((refmt-bin (or (shell-cmd "refmt ----where")
                        (shell-cmd "which refmt")))
         (merlin-bin (or (shell-cmd "ocamlerlin ----where")
                         (shell-cmd "which ocamlmerlin")))
         (merlin-base-dir (when merlin-bin
                            (replace-regexp-in-string "bin/ocamlmerlin$" "" merlin-bin))))
    ;; Add npm merlin.el to the emacs load path and tell emacs where to find ocamlerlin
    (when merlin-bin
      (add-to-list 'load-path (concat merlin-base-dir "share/emacs/site-lisp/"))
      (setq merlin-command merlin-bin))
    (when refmt-bin
      (setq refmt-command refmt-bin)))
  )

(use-package vimrc-mode
  :straight t)

(use-package lua-mode
  :straight t)

(use-package s
  :straight (:host github :repo "magnars/s.el");; :files ("s.el"))
  :ensure t)

(use-package dash
  :straight (:host github :repo "magnars/dash.el");; :files ("dash.el"))
  :ensure t)

(use-package copilot
  :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
  :bind (:map copilot-completion-map
              ("M-l" . 'copilot-accept-completion)
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))

(dolist (mode '(prog-mode-hook
                org-mode-hook))
  (add-hook mode 'copilot-mode))

(use-package flycheck
  :straight t
  :defer t
  :hook (lsp-mode . flycheck-mode))

(use-package yasnippet
  :straight t
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-reload-all))

(use-package smartparens
  :straight t
  :hook (prog-mode . smartparens-mode))

(use-package rainbow-mode
  :straight t
  :defer t
  :hook (org-mode
         emacs-lisp-mode
         web-mode
         typescript-mode
         js2-mode))

(use-package company
  :straight t
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :straight t
  :hook (company-mode . company-box-mode))

(use-package projectile
  :straight t
  :diminish projectile-mode
  :bind
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder you keep your git repos
  (when (file-directory-p "~/code")
    (setq projectile-project-search-path '("~/code"))))
  ;; (setq projectile-switch-project-action #'projectile-dired))

(use-package rainbow-delimiters
  :straight t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package restclient
  :straight t
  :mode ("\\.http\\'" . restclient-mode))

(use-package term
  :straight t
  :config
  (setq explicit-shell-file-name "zsh"))

(use-package eterm-256color
  :straight t
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :straight t
  :commands vterm
  :config
  (setq vterm-max-scrollback 10000))

(defun personal/configure-eshell()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performace
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :straight t)

(use-package eshell
  :hook (eshell-first-time-mode . personal/configure-eshell)
  :config
  (eshell-git-prompt-use-theme 'powerline))

(use-package eshell-toggle
  :straight t
  :bind ("C-x C-t" . eshell-toggle)
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-project-root t)
  (eshell-toggle-run-command nil))

(use-package docker
  :straight t
  :commands docker)

(use-package dockerfile-mode
  :straight t
  :config
  (require 'dockerfile-mode)
  (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)))

(use-package ripgrep
  :straight t)

(use-package deadgrep
  :straight t)

(use-package crux
  :straight t)
